[
{
"is_sarcastic": 1,
"headline": "thirtysomething scientists unveil doomsday clock of hair loss",
"article_link": "https://www.theonion.com/thirtysomething-scientists-unveil-doomsday-clock-of-hai-1819586205",
"article_text": ""
},
{
"is_sarcastic": 0,
"headline": "dem rep. totally nails why congress is falling short on gender, racial equality",
"article_link": "https://www.huffingtonpost.com/entry/donna-edwards-inequality_us_57455f7fe4b055bb1170b207",
"article_text": "\"We are neither post-racial nor post-gender,\" Rep. Donna Edwards (D-Md.) proclaims in a new essay taking on Congress for not addressing inequality. One of the major barriers is that America's elected officials don't represent the most disenfranchised populations, Edwards argues in the Cosmopolitan magazine piece, published on Tuesday.\"Can we pass equal pay laws and give women control of their own health-care decisions when women represent just 20 percent of Congress?\" she says. Even when women get elected to office, men still hold the large majority of leadership positions, The New York Times pointed out last year.Edwards, who lost a Senate primary race to Rep. Chris Van Hollen (D-Md.), specifically criticized Democrats for not being inclusive of the voters who have"
},
{
"is_sarcastic": 0,
"headline": "eat your veggies: 9 deliciously different recipes",
"article_link": "https://www.huffingtonpost.com/entry/eat-your-veggies-9-delici_b_8899742.html",
"article_text": "Vegetables don't have to be boring or relegated to a side dish. From roasted broccoli with chipotle honey butter to balsamic glazed roasted beets, these recipes are so flavorful and satisfying, they could carry an entire meal. 1. Roasted Broccoli with Chipotle Honey ButterIn this recipe, broccoli florets are tossed in a sweet, spicy and smoky chipotle-honey butter before roasting. It's as delicious as it sounds, and the broccoli has enough flavor to carry an entire meal. Serve it as a main course with rice or as a side dish to simply grilled fish or meat. GET THE RECIPE2. Golden Roasted Cauliflower with Pecorino Romano CheeseWant to get your family to love cauliflower? Try roasting it and tossing it with"
},
{
"is_sarcastic": 1,
"headline": "inclement weather prevents liar from getting to work",
"article_link": "https://local.theonion.com/inclement-weather-prevents-liar-from-getting-to-work-1819576031",
"article_text": "PROVIDENCE, RI—In spite of his best efforts to brave the ongoing winter storm and freezing temperatures, the inclement weather currently affecting the Northeast has left Providence-area liar Tim Carlson unable to commute to his office, the habitual deceiver reported to his colleagues today. “They haven’t been able to plow my street yet and the snow drifts have to be two feet high in some places, so I don’t really think there’s any way for me to make it in,” said an email sent from the man who spent 45 minutes attempting to dislodge his car from a snowbank and who routinely fabricates stories. “On top of that, the buses don’t seem to be running in my area, or else I"
},
{
"is_sarcastic": 1,
"headline": "mother comes pretty close to using word 'streaming' correctly",
"article_link": "https://www.theonion.com/mother-comes-pretty-close-to-using-word-streaming-cor-1819575546",
"article_text": "PATERSON, NJ—Family sources told reporters Tuesday that local mother Karen Burkhart came fairly close to using the term “streaming” correctly during a recent conversation. “She likes that Orange Is The New Black show and told us that she started ‘stream-watching’ a couple of episodes,” said daughter Melanie Burkhart, who was reportedly surprised by her mother’s nearly accurate usage of the technical jargon. “I thought, wow, she actually got really close to the actual meaning of the word. She almost nailed it. And this is the woman who asked if the internet was as good as the online. It’s certainly the most precise she’s been in a long time.” At press time, Burkhart’s children decided to give it to her, claiming"
},
{
"is_sarcastic": 0,
"headline": "my white inheritance",
"article_link": "https://www.huffingtonpost.com/entry/my-white-inheritance_us_59230747e4b07617ae4cbe1a",
"article_text": "To what extent do you own your inheritance? Life is cumulative. At the end of our lives, we take all that we’ve earned, learned, and collected and pass it along to those that carry on our legacy. Recently, while doing research on my family like so many do on the internet, I pieced together parts of my family history. Decades of census reports track the progress of my ancestors from their arrival to America from Europe and Canada in the early 1900’s through the steel mills of central New England, each generation moving up in education and class. My family history embodies America’s promise. My great-grandfather, Anthony Golaszewski, an immigrant from Poland arrived at Ellis Island in 1907. With the"
},
{
"is_sarcastic": 0,
"headline": "5 ways to file your taxes with less stress",
"article_link": "https://www.huffingtonpost.com/entry/5-ways-to-file-your-taxes_b_6957316.html",
"article_text": "Even with years of experience, the process of reviewing your records and filing your tax return can be stressful. With the April 15 tax deadline getting close, consider trying these five strategies that may help you lower your 2014 taxes, enhance your retirement readiness and help you get more organized for 2015.1. Leverage your retirement accountsIf you currently have an individual retirement account (IRA), you have up until April 15to make any contributions for the 2014 tax year. That means you may be able to lower your taxable income for 2014. The contribution limit to an IRA for 2014 is $5,500 (or $6,500 for those over 50) so try to reach that number before the deadline. Eligibility for an IRA"
},
{
"is_sarcastic": 1,
"headline": "richard branson's global-warming donation nearly as much as cost of failed balloon trips",
"article_link": "https://www.theonion.com/richard-bransons-global-warming-donation-nearly-as-much-1819568749",
"article_text": "LONDON—Analysts are predicting that the $3 billion Sir Richard Branson has pledged for developing energy sources to combat global warming could come close to matching the amount the entrepreneur, adventurer, and Virgin CEO has already spent on elaborate balloon-based excursions."
},
{
"is_sarcastic": 1,
"headline": "shadow government getting too large to meet in marriott conference room b",
"article_link": "https://politics.theonion.com/shadow-government-getting-too-large-to-meet-in-marriott-1819570731",
"article_text": "COLUMBUS, OH—With its membership swelling in recent months, the mysterious organization that secretly pulls the levers of American power was forced to suspend its weekly meeting Monday, having grown too big to fit inside Marriott Conference Room B. \"To successfully carry out our clandestine operations and continue maintaining the ignorance of the masses, we will now require the full amenities of Conference Room A,\" said an unidentified man, who is believed to have covertly orchestrated the economic collapse of Iceland last year. \"We must postpone the Cataclysmic Event until such time as a more comfortable meeting space is available.\" According to confidential records, the hidden regime's enrollment has more than doubled since it gained free access to the Marriott's swimming"
},
{
"is_sarcastic": 0,
"headline": "lots of parents know this scenario",
"article_link": "https://www.huffingtonpost.comhttp://pubx.co/6IXxhm",
"article_text": ""
}
]